ERM/src/Catalogs/LegalEntiites.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>LegalEntiites</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ERM/src/InformationRegisters/ЛогВыгрузкиPowerBI/ЛогВыгрузкиPowerBI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогВыгрузкиPowerBI</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>EnumRef.ТипыСобытийИнтеграцииPowerBI</types>
    </type>
  </resources>
  <resources>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииPowerBI</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомерСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DefinedType.ИсточникДанныхPowerBI</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/Enums/ОперацииPowerBI/ОперацииPowerBI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииPowerBI</name>
  <enumValues>
    <name>Create</name>
  </enumValues>
  <enumValues>
    <name>Update</name>
  </enumValues>
  <enumValues>
    <name>Delete</name>
  </enumValues>
</mdclass:Enum>

ERM/src/Catalogs/LegalEntiites/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область PowerBI

// Описание
// Выполняет выгрузку данных в Power BI
// Параметры:
// 	Ссылка - Ссылка на данные, которые нужно выгрузить
// 	Операция - вид операции с данными
// Возвращаемое значение:
// 	Структура - включает поля Результат, Сообщение.
Функция ВыгрузитьДанныеДляPowerBI(Ссылка, Операция, ПараметрыЛогирования) Экспорт
	
	СтруктураРезультата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Код, ПометкаУдаления, Наименование, Владелец, Source");
	
	Если Операция = Перечисления.ОперацииPowerBI.Create Тогда
		ПараметрыЛогирования.Событие = Перечисления.ТипыСобытийИнтеграцииPowerBI.СозданиеОбъекта;
		РегистрыСведений.ЛогВыгрузкиPowerBI.ЗалогироватьСобытие(ПараметрыЛогирования);
		ТекОбъект = ВнешниеИсточникиДанных.ERM_BI.Таблицы.dbo_LegalEntiites.СоздатьОбъект();
		ТекОбъект.ID = Строка(Ссылка.УникальныйИдентификатор());
	Иначе
		ПараметрыЛогирования.Событие = Перечисления.ТипыСобытийИнтеграцииPowerBI.ПолучениеОбъекта;
		РегистрыСведений.ЛогВыгрузкиPowerBI.ЗалогироватьСобытие(ПараметрыЛогирования);
		СсылкаВоВнешнемИсточнике = ВнешниеИсточникиДанных.ERM_BI.Таблицы.dbo_LegalEntiites.ПолучитьСсылку(Строка(Ссылка.УникальныйИдентификатор()));
		ТекОбъект = СсылкаВоВнешнемИсточнике.ПолучитьОбъект();
	КонецЕсли;
	ТекОбъект.DeletionMark = СтруктураРеквизитов.ПометкаУдаления;
	ТекОбъект.Description = СтруктураРеквизитов.Наименование;
	ТекОбъект.Code = СтруктураРеквизитов.Код;
	БазовыйЭлемент = Неопределено;
	Если ЗначениеЗаполнено(СтруктураРеквизитов.Владелец) Тогда
		БазовыйЭлемент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитов.Владелец, "БазовыйЭлемент");
	КонецЕсли;
	Если ЗначениеЗаполнено(БазовыйЭлемент) Тогда
		ТекОбъект.OwnerID = Строка(БазовыйЭлемент.УникальныйИдентификатор());
	Иначе
		ТекОбъект.OwnerID = NULL;
	КонецЕсли;
	ТекОбъект.Source = Строка(СтруктураРеквизитов.Source);
	ПараметрыЛогирования.Событие = Перечисления.ТипыСобытийИнтеграцииPowerBI.НачалоЗаписи;
	РегистрыСведений.ЛогВыгрузкиPowerBI.ЗалогироватьСобытие(ПараметрыЛогирования);
	Попытка
		ТекОбъект.Записать();
	Исключение
		СтруктураРезультата.Сообщение = ОписаниеОшибки();
		Возврат СтруктураРезультата;
	КонецПопытки;
	ПараметрыЛогирования.Событие = Перечисления.ТипыСобытийИнтеграцииPowerBI.ОкончаниеЗаписи;
	РегистрыСведений.ЛогВыгрузкиPowerBI.ЗалогироватьСобытие(ПараметрыЛогирования);
	
	СтруктураРезультата.Результат = Истина;
	Возврат СтруктураРезультата;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
